ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_msvw07_1.h
/** \brief ESPI_MSVW07_1 register offsets definitions */
#define ESPI_MSVW07_1_MSVW07_DW0_OFFSET (0x00)         /**< (ESPI_MSVW07_1_MSVW07_DW0) Master-to-Slave Virtual Wire 7 Register (DW 0) Offset */
#define ESPI_MSVW07_1_MSVW07_DW1_OFFSET (0x04)         /**< (ESPI_MSVW07_1_MSVW07_DW1) Master-to-Slave Virtual Wire 7 Register (DW 1) Offset */
#define ESPI_MSVW07_1_MSVW07_DW2_OFFSET (0x08)         /**< (ESPI_MSVW07_1_MSVW07_DW2) Master-to-Slave Virtual Wire 7 Register (DW 2) Offset */
#define ESPI_MSVW07_1_MSVW08_DW0_OFFSET (0x0C)         /**< (ESPI_MSVW07_1_MSVW08_DW0) Master-to-Slave Virtual Wire 8 Register (DW 0) Offset */
#define ESPI_MSVW07_1_MSVW08_DW1_OFFSET (0x10)         /**< (ESPI_MSVW07_1_MSVW08_DW1) Master-to-Slave Virtual Wire 8 Register (DW 1) Offset */
#define ESPI_MSVW07_1_MSVW08_DW2_OFFSET (0x14)         /**< (ESPI_MSVW07_1_MSVW08_DW2) Master-to-Slave Virtual Wire 8 Register (DW 2) Offset */
#define ESPI_MSVW07_1_MSVW09_DW0_OFFSET (0x18)         /**< (ESPI_MSVW07_1_MSVW09_DW0) Master-to-Slave Virtual Wire 9 Register (DW 0) Offset */
#define ESPI_MSVW07_1_MSVW09_DW1_OFFSET (0x1C)         /**< (ESPI_MSVW07_1_MSVW09_DW1) Master-to-Slave Virtual Wire 9 Register (DW 1) Offset */
#define ESPI_MSVW07_1_MSVW09_DW2_OFFSET (0x20)         /**< (ESPI_MSVW07_1_MSVW09_DW2) Master-to-Slave Virtual Wire 9 Register (DW 2) Offset */
#define ESPI_MSVW07_1_MSVW10_DW0_OFFSET (0x24)         /**< (ESPI_MSVW07_1_MSVW10_DW0) Master-to-Slave Virtual Wire 10 Register (DW 0) Offset */
#define ESPI_MSVW07_1_MSVW10_DW1_OFFSET (0x28)         /**< (ESPI_MSVW07_1_MSVW10_DW1) Master-to-Slave Virtual Wire 10 Register (DW 1) Offset */
#define ESPI_MSVW07_1_MSVW10_DW2_OFFSET (0x2C)         /**< (ESPI_MSVW07_1_MSVW10_DW2) Master-to-Slave Virtual Wire 10 Register (DW 2) Offset */

/** \brief ESPI_MSVW07_1 register API structure */
typedef struct
{  /* The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */
  __IO  __ESPI_MSVW07_1_MSVW07_DW0_bits_t MSVW07_DW0;    /**< Offset: 0x00 (R/W  32) Master-to-Slave Virtual Wire 7 Register (DW 0) */
  __IO  __ESPI_MSVW07_1_MSVW07_DW1_bits_t MSVW07_DW1;    /**< Offset: 0x04 (R/W  32) Master-to-Slave Virtual Wire 7 Register (DW 1) */
  __IO  __ESPI_MSVW07_1_MSVW07_DW2_bits_t MSVW07_DW2;    /**< Offset: 0x08 (R/W  32) Master-to-Slave Virtual Wire 7 Register (DW 2) */
  __IO  __ESPI_MSVW07_1_MSVW08_DW0_bits_t MSVW08_DW0;    /**< Offset: 0x0C (R/W  32) Master-to-Slave Virtual Wire 8 Register (DW 0) */
  __IO  __ESPI_MSVW07_1_MSVW08_DW1_bits_t MSVW08_DW1;    /**< Offset: 0x10 (R/W  32) Master-to-Slave Virtual Wire 8 Register (DW 1) */
  __IO  __ESPI_MSVW07_1_MSVW08_DW2_bits_t MSVW08_DW2;    /**< Offset: 0x14 (R/W  32) Master-to-Slave Virtual Wire 8 Register (DW 2) */
  __IO  __ESPI_MSVW07_1_MSVW09_DW0_bits_t MSVW09_DW0;    /**< Offset: 0x18 (R/W  32) Master-to-Slave Virtual Wire 9 Register (DW 0) */
  __IO  __ESPI_MSVW07_1_MSVW09_DW1_bits_t MSVW09_DW1;    /**< Offset: 0x1C (R/W  32) Master-to-Slave Virtual Wire 9 Register (DW 1) */
  __IO  __ESPI_MSVW07_1_MSVW09_DW2_bits_t MSVW09_DW2;    /**< Offset: 0x20 (R/W  32) Master-to-Slave Virtual Wire 9 Register (DW 2) */
  __IO  __ESPI_MSVW07_1_MSVW10_DW0_bits_t MSVW10_DW0;    /**< Offset: 0x24 (R/W  32) Master-to-Slave Virtual Wire 10 Register (DW 0) */
  __IO  __ESPI_MSVW07_1_MSVW10_DW1_bits_t MSVW10_DW1;    /**< Offset: 0x28 (R/W  32) Master-to-Slave Virtual Wire 10 Register (DW 1) */
  __IO  __ESPI_MSVW07_1_MSVW10_DW2_bits_t MSVW10_DW2;    /**< Offset: 0x2C (R/W  32) Master-to-Slave Virtual Wire 10 Register (DW 2) */
} espimsvw071_registers_t;
/** @}  end of The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */

#endif /* _PIC32CX_0525SG12_ESPI_MSVW07_1_COMPONENT_H_ */
